In [ ]:
# 다다음주 월요일에 프로젝트 계획을 수립하고 프로젝트 수행을 하게 된다.
# 4일간에 프로젝트를 수행할 예정이다.
# 1차 시각화 프로젝트를 수행할 예정이다.
# 데이터 수집을 다루고.플랏리 등의 패키지를 사용하는 방법을 학습할 예정이다.
# 실제 데이터를 웹에서 가지고 와서 그것을 전처리 한 이후 전처리한 결과에 대해 시각적으로 나타내는 프로젝트를 할 예정이다.
# 데이터가 가지고 있는 인사이트, 잠재되어져 있는 의미를 분석하고 추출을 할 수 있는 시각화 프로젝트를 할 예정이다.
# 계획으로는 셀레늄, 시각화 도구들을 이용하여 시각화 프로젝트를 수행할 예정이다. 
# 10월 6일에 포트폴리오를 깃헙에 올리는 방식으로 예정되어져 있다. 
# 이후 곧바로 머신러닝에 들어가게 된다. 
# 딥러닝이 진행될 예정이다.
# 공모전 등에 참여하는 것도 좋다. 
# 1월 9일 발표 전까지 서로 도우면서 공부합시다.

In [2]:
# 강평. 
# 먼저 쉬운 코드를 만들어서 답을 제출하고 어려운 코드를 추가로 작성하자.
# 내가 너무 어려운 길로만 들어가려고 한다. 오히려 시간낭비이다.
# 만약 내가 원하는 코드를 만들었다고 해도 그것이 정답이라는 보장은 없다. 
# 1차원 자료를 쓴다면 1차원 자료에 맞게 쓰자. 데이터프레임 쓰다가 쓸데없이 코드를 낭비했다.
# 즉 표인지 1차원 자료인지 먼저 파악부터 하자. 무작정 데이터 프레임을 쓰지 말자.
# 변수명은 의미가 있는 것으로 부여하자.
# 예외변수는 항상 생각해야 한다. 성씨가 김씨일 수도 있지만 이름에 김자가 들어갈 수도 있는 것처럼
# 그래서 for문을 쓸 때는 조심해야 한다. 
# 고집을 줄이자. 나의 방식이 항상 맞는 것은 아니다. 
# 함수중 startswith(문자열)함수가 존재한다. 특징은 시작요소, 시작문자를 찾는 방법 중 하나이다. 
# ADsP시험도 준비해보자.
# 함수사전을 만들어 보는건 어떨까?
name = "김말똥"
print(name.startswith("김"))
print(name.startswith("김말"))

True
True

In [5]:
import numpy as np
a = [10,20,5,1]
print(np.argmax(a))#최댓값의 인덱스 위치
print(np.argmin(a))#최솟값의 인덱스 위치

1
3

In [2]:
import numpy as np
import pandas as pd

In [ ]:
# 판다스에서 데이터를 읽어들이는 포멧은 대체로 csv이다. 엑셀파일도 가끔 쓰인다. htlm, xml, hdf5, sas, sql, json등 다양하다.
# 불러오기를 할 때는 pd.read.csv같이 사용한다.
# 주피터 노트북에서는 매직명령으로 간단하게 만들 수 있다. 퍼센트 두 개는 매직명령이다. 
# csv는 콤마로 분류된 파일포멧이다. 일반적으로 사용되는 포멧이다.

In [7]:
%%writefile sample1.csv
c1, c2, c3
1, 1.1, one
2, 2.2, two
3, 3.3, three
# csv파일로 저장하는 방법이다.

Writing sample1.csv

In [8]:
pd.read_csv("sample1.csv")
# 파일을 여는 것은 다음과 같이 열 수 있다. read에서 탭을 눌러서 다른 파일도 부를 수 있다.
# 특이점은 행 인덱스가 0 1 2로 왔고 c1, c2, c3가 열 인덱스로 왔다.
# 만약 열에 대한 제목이 없으면 어떻게 될까?

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [9]:
%%writefile sample2.csv
1, 1.1, one
2, 2.2, two
3, 3.3, three

Writing sample2.csv

In [10]:
pd.read_csv("sample2.csv")
# 문제는 1과 1.1, one이 열 인덱스로 오는 문제점이 발생했다.
# 이것은 이 함수가 잘못된 것이 아닌 read_csv가 이런 식으로 읽는 성질이 있기 때문이다.

   1   1.1     one
0  2   2.2     two
1  3   3.3   three

In [11]:
pd.read_csv("sample2.csv", names = ['c1','c2','c3'])
# 해결 방법은 열 이름을 직접 입력하는 것이다.

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [12]:
pd.read_csv("sample1.csv")
# 간혹 데이터의 특정 열에 날짜 데이터가 저장되는 경우가 존재한다. 날짜 데이터를 행 인덱스로 설정하고 싶다고 해보자.
# 특정열에 저장되어져 있는 값을 행 인덱스로 설정하려면 어떻게 해야할까?

   c1   c2      c3
0   1  1.1     one
1   2  2.2     two
2   3  3.3   three

In [15]:
pd.read_csv("sample1.csv", index_col ='c1')
# 실수, 문자는 되지 않는다. 정수, 날짜형식만 인덱스로 부여 가능하다.
# 이런 식으로 행인덱스를 특정 열로 지정할 수 있다.

     c2      c3
c1
1   1.1     one
2   2.2     two
3   3.3   three

In [ ]:
# 만약 컴마가 아닌 다른 문자로 구분되어져 있는 경우에 어떻게 해야 하는가?

In [16]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515
#콤마로 구분되어지는게 아닌 공백문자로 구분이 되어있다.
# 데이터들끼리는 띄어쓰기가 한칸이지만 이름에는 여러 칸이 띄어져 있는 느낌이다.

Writing sample3.txt

In [19]:
pd.read_csv("sample3.txt")
# 읽을 수는 있는데 컴마로 구분하는 데이터라서 그냥 나열되어버렸다.
#4개의 데이터는 하나의 열이 되어버렸다.

        c1        c2        c3        c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [34]:
pd.read_csv("sample3.txt",sep =" ")
#공백문자로 구분하면 이런 참사가 발생한다. 공백의 갯수를 늘리면 경고문이 뜬다.

,c1,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,c2,Unnamed: 9,...,Unnamed: 15,c3,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,c4
0,0.179181,-1.538472,NaN,1.347553,NaN,0.43381,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.024209,NaN,0.087307,-1.281997,NaN,0.49265,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,0.417899,-2.002308,NaN,0.255245,-1.10515,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
df =pd.read_csv("sample3.txt",sep ="\s+")
df
# \s는 공백문자이다. 그리고 플러스는 몇 개든 상관없다는 뜻이다.
# 이런 식으로 공백문자로 구분된 데이터프레임을 저장이 가능하다.

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [40]:
df.shape

(3, 4)

In [41]:
df2 =pd.read_table("sample3.txt",sep ="\s+")
df2
# 테이블 기반으로 출력하였다. 결과는 동일할 것이다.
# 형식이 깔끔하게 저장되어 있으면 감사한 일이다. 대체로 저장이 이상하게 되어있는 경우가 많다.
# 불필요한 텍스트가 많은 경우가 비일비재하다. 전처리가 쉽지 않다.

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [42]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three
#만약 이런 식으로 파일이 만들어져 있는 경우를 살펴보자. 파일제목, 데이터포멧 설명 등 특이한 부분이 추가되었다.
# 제목은 c1,c2,c3인데 문제가 맨 위의 두 줄이 생겨서 원치않는 데이터가 읽어지게 된다.

Writing sample4.txt

In [44]:
pd.read_csv("sample4.txt") 
# 첫번째줄과 두번째줄은 콤마조차도 없다.  
# Parser error가 발생했다. 한개의 필드가 있어야 하는데 필드가 3개이기 때문에 오류가 발생했다. 1,2행은 1개의 열로 본 것이다.
# Parser는 구문분석기이다. 
# 1,2행을 빼거나 나머지의 콤마를 제거하는 등으로 해결할 수 있다. 
# 하지만 위에 두 줄은 설명문이다. 즉 필요한 부분이다. 만약 2줄을 건너뛰고 읽어들이고 싶다면 skiprows라는 조건이 있다.

ParserError: Error tokenizing data. C error: Expected 1 fields in line 3, saw 3

In [45]:
pd.read_csv("sample4.txt",skiprows = [0,1]) 
# 제대로 작동한다. 건너뛰기는 정상적으로 이루어졌다.
# 0번줄과 1번줄을 빼버리고 2번줄부터 출력한다.
# 텍스트글은 설명문이 적혀있는 경우가 많다. 그래서 이러한 옵션등을 사용하는 것이 좋다.

# https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html
# 판다스 사전이다. 참고하자.

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [53]:
# 많이 있는 사례를 하나 더 이야기하자면 다음과 같다.
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three
#매직문자를 쓸 때는 맨 윗행에서 실행해야 한다. 아니면 애러가 발생한다.

SyntaxError: invalid syntax (3600818519.py, line 5)

In [54]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [55]:
df=pd.read_csv("sample5.csv")
df

   c1     c2      c3
0   1   1.11     one
1   2            two
2  누락   3.33   three

In [56]:
df.info()
# 이 자료는 판다스 데이터프레임입니다.
# 이 자료의 인덱스는 3개로 0부터 2까지 존재합니다.
# 데이터열은 3건이 존재합니다.
# null은 결측값을 의미합니다. 3개의 데이터가 결측값이 아닙니다.
# 데이터 타입은 문자타입(object)입니다. 
# 결국에는 제대로 처리가 안된 것이다. 누락은 값이 없는 것이다. 
# 누락을 표시하고 싶다면 어떻게 하는가

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      3 non-null      object
 1    c2     3 non-null      object
 2    c3     3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [57]:
df=pd.read_csv("sample5.csv", na_values ="누락")

In [58]:
df#누락된 것을 nan으로 표시했다. 컴퓨터는 누락을 인식하게 된 것이다.

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

In [59]:
df.info()# 데이터가 플롯으로 바뀐 것을 볼 수 있다. nan은 취급하지 않기 때문이다.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      2 non-null      float64
 1    c2     3 non-null      object
 2    c3     3 non-null      object
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

In [67]:
%%writefile sample5.csv
c1, c2, c3
1, , one
2,모름, two
누락, 3.33, three

Overwriting sample5.csv

In [62]:
df=pd.read_csv("sample5.csv", na_values =["누락","모름"])
df # 두 요소를 추가한다면 리스트로 묶어줘야 한다.

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [66]:
%%writefile sample5.csv
c1, c2, c3
1,  , one
2,모름, two
누락, 3.33, three

Overwriting sample5.csv

In [68]:
df=pd.read_csv("sample5.csv", na_values =["누락","모름"," "])
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [69]:
# 파일을 저장하는 방법에 대해서 알아보자.
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [70]:
df.to_csv("sample6.csv")
# 특이한 점은 인덱스와 함께 저장이 되어진다. 
# 만약 인덱스를 같이 저장하고 싶지 않을 때에는

In [71]:
df.to_csv("sample6.csv", index=False)
# 만약 인덱스를 같이 저장하고 싶지 않을 때에는 인덱스를 폴스로 바꾼다. 그렇다면 인덱스칸이 삭제되어 저장된다.
# 만약 케글에서 제출할 때 인덱스를 폴스로 해서 제출해야 할 때가 있을 것이다.

In [72]:
df.to_csv("sample7.csv", sep = "@") #sep로 지정되는 문자로 구분되어서 저장된 것을 볼 수 있다.
# 기본적으로 csv함수로 저장하면 콤마(,)를 기준으로 저장이 되어진다. 만약 직접 설정할 경우에는 sep로 지정한 값으로 구분되어 저장된다.

In [73]:
df

    c1    c2      c3
0  1.0   NaN     one
1  2.0   NaN     two
2  NaN  3.33   three

In [74]:
# 결측값은 엑셀에서 공백으로 나타난다.
# 만약 공백이 아닌 지정하고자 하는 특정한 문자열로 저장을 하고싶다고 하자.
# '자료없음'이라는 단어를 출력하고자 한다면? na replace 옵션을 쓰자.
df.to_csv("sample8.csv", index = False, na_rep= "자료없음")

In [ ]:
# 데이터를 읽고, 저장하고, 결측값을 처리하고, 저장할 때 결측값을 특정단어로 저장하는 법에 대해서 배웠다.
# 인덱스를 지정하는 법도 배웠다.

In [76]:
df
df.index#(인덱스는 0부터 2까지 1의 단위로 이루어진다.)

RangeIndex(start=0, stop=3, step=1)

In [77]:
df.columns#컬럼은 3개가 정상적으로 출력된다.

Index(['c1', ' c2', ' c3'], dtype='object')

In [79]:
# 만약 행인덱스를 바꾸고 싶다고 하자.
df.index = ['a','b','c']
df#인덱스는 직접 지정하면 된다.

    c1    c2      c3
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [81]:
df.columns = ['x','y','z']
df

     x     y       z
a  1.0   NaN     one
b  2.0   NaN     two
c  NaN  3.33   three

In [82]:
df.to_csv("sample9.csv", index = False, header=False) #헤더를 이용해서 위의 칸을 제거하는 것도 가능하다.

In [85]:
# csv파일을 웹에서 가져온다면? 
# 깃허브 주소를 가져와서 저장하는 법을 알아보자.
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")
df
#pd.read_csv로 웹에 있는 파일을 가져올 수 있다.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [86]:
pd.read_csv("ex1.csv") # 노말한 부분

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [87]:
pd.read_csv("ex2.csv") # 헤더가 없는 경우

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [88]:
pd.read_csv("ex2.csv", header = None) # 헤더를 직접 지정하거나 None으로 지정해서 만들 수 있다.
# 이럴 경우 숫자가 헤더 이름으로 지정된다.
# 만약 이름을 지정하고 싶다면 names를 쓰자.

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [89]:
pd.read_csv("ex2.csv", header = None, names=['a','b','c','d','msg']) # 네임즈로 헤더 이름을 부어했다.

   a   b   c   d    msg
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [91]:
pd.read_csv("ex2.csv", header = None,names=['a','b','c','d','msg'], index_col="msg") #특정 열을 인덱스로 사용하고 싶을 경우 
#열 인덱스를 직접 부여하면 된다.

       a   b   c   d
msg
hello  1   2   3   4
world  5   6   7   8
foo    9  10  11  12

In [92]:
pd.read_csv("csv_mindex.csv") # 8건의 데이터가 존재하고 피쳐(머신러닝에서 말하는 행)가 4개여서 4차원 데이터로 볼 수 있다.
#만약 key로 인덱스를 바꾸고자 한다면

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [93]:
pd.read_csv("csv_mindex.csv", index_col = "key1")

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

In [94]:
pd.read_csv("csv_mindex.csv", index_col = "key2")
#재밌는 것은 저 두개를 대괄호로 묶을 수 있다.

     key1  value1  value2
key2
a     one       1       2
b     one       3       4
c     one       5       6
d     one       7       8
a     two       9      10
b     two      11      12
c     two      13      14
d     two      15      16

In [95]:
pd.read_csv("csv_mindex.csv", index_col = ["key2","key1"])

           value1  value2
key2 key1
a    one        1       2
b    one        3       4
c    one        5       6
d    one        7       8
a    two        9      10
b    two       11      12
c    two       13      14
d    two       15      16

In [96]:
# 두 개의 인덱스가 동시에 사용된다. 
# 인덱스는 구분하는 용도로 사용된다. 지금의 경우에는 조금 어려울 수 있다.
pd.read_csv("csv_mindex.csv", index_col = ["key1","key2"])

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [100]:
# 아까랑 다르다. 묶여져서 나온다. 
# 이걸 멀티 인덱스라고 한다. 데이터를 구분하기 위해 데이터를 대,중,소분류등으로 나눠서 저장/참조하기 위해서 사용한다.
# 데이터를 분류하고자 할 때 사용 가능한 방식이다. 
pd.read_csv("ex3.txt")
# 현재도 빈칸으로 되어있다.

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [ ]:
# 아까 배웠던 방식을 그대로 적용해보자. 
pd.read_csv("ex3.txt", sep = "\s+")

In [ ]:
# 여담
# 보통 프로젝트를 일찍 끝났다고 해서 빨리 마무리를 하면 안된다. 
# 일이 많이 늘어난다. 그 동안 코딩실력을 늘리는 것도 하나의 방법이다.
# 반대로 프로젝트가 너무 느리게 될거 같을 때가 존재한다.
# 물론 그 이전에 계약을 잘 체결해야한다.
# 기간도 설정하고 산출물이 어떤 식으로 나와야 한다. 프로토타입이 나와야 한다.
# 데이터 분석을 할 경우 문제있는 경우가 수두룩하다. 시간도 많이 걸리고 결과물도 안좋을 수 있다.
# 데이터 다루는 것이 쉽지 않다. 품질이 좋은 데이터를 만드는 것도 힘들다.
# 현재의 데이터들은 엄청 말끔한 편이다. 현실은 시궁창이다.
# 프로그래머는 변화의 직업이다. 계속 쉽지도 않고 계속 어렵지도 않다.
# 이 바닥은 항상 변한다. 변화에 빠르게 적응하는 것이 좋다. 
# 현재에는 넘파이, 판다스를 많이 사용한다. 정제가 된 이후부터는 오히려 사용하지 않는다.
# 이후에는 알고리즘에 대해 손을 대게 된다. 그런 순서로 가게 된다.
# 판다스는 실무에서 잠깐 하는 수준으로 끝나는 경우가 많다. 가끔가끔 쓰다보면 까먹는 경우가 비일비재하다.
# 이게 있다없다를 알 수 있다면 큰 도움이 된다.
# 구글 선생님을 자주 사용하자. GPT도 도움이 된다.

In [101]:
pd.read_csv("ex4.csv")

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [102]:
# 메모장을 보니 샵기호는 설명을 위해서 쓰인 것 같다. 비실행문인 것이다.
# 일반적인 텍스트 파일에서도 샾을 붙여놨다.
# 샾이 붙어있는 문자들은 읽으면 안되고 샾이 안붙은 제목부와 자료부는 나타나야 한다.
pd.read_csv("ex4.csv", skiprows=[0,2,3])
# 스킵기능을 사용해서 해결하자.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [107]:
pd.read_csv("ex5.csv")

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [108]:
# 메모장에서 na라고 써져있으면 인간은 결측값이면 짐작할 수 있다. 하지만 파이썬은 알 수 없다.
df = pd.read_csv("ex5.csv")
df

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [109]:
df.isnull()#없는 자료로 인식하는가? 에 대한 부분이다. 특정 문자열이나 누락된 부분이 읽었을 때 그대로 나올때 na변수를 지정한다.
#현재는 na라고 써져있어서 자동적으로 nan으로 인식된다. NaN,NA," "등의 데이터값은 csv에서 읽을 경우 자동으로 결속문자로 처리된다.
#만약 결측값을 임의로 지정하는 경우에는 na_values = 옵션을 사용한다.

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [112]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""
#겹 따옴표 3개는 문자열의 시작과 문자열의 끝을 나타낸다. 
# 한 줄에 걸쳐서 홀따옴표('')와 겹따옴표("")가 사용된다. 여러 줄에 걸쳐서 사용할 경우에는 '''   '''이런식으로 사용한다.
# 중괄호가 시작부터 끝까지가 해당된다. 
# 딕셔너리 구조의 값으로 자료들이 있으며 이름, 거주지, 애완동물, 가족정보 등으로 이루어져 있다. 
# 어느 것은 리스트로 저장되어져 있고 어느것은 딕셔너리, 리스트, 딕셔너리, 리스트 이런 식으로 매우 많이 중첩이 되어있다.
# 이러한 구성을 흔히 볼 수 있다.
# 현재의 것은 문자열이다. 데이터에 지나지 않는다. 
# 이런 형태의 파일 포멧을 Json이라고 한다. 파일형식이 Json이면 딕셔너리 구조로 저장되어져 있다고 이해하면 된다.
# Json은 굉장히 가벼운 구조로 저장이 용이하다. 용량이 적고 입출력이 빠른 것이 장점이다.
# 웹상에서 데이터를 가지고 왔다고 하자. 가지고 온 모양이 위와 같다고 하자.
# 제이슨 형식의 문서를 열고자 한다면?

In [113]:
import json

In [115]:
res = json.loads(obj)
res

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [116]:
type(res) #타입은 딕셔너리이다.

dict

In [118]:
asjson = json.dumps(res)
asjson #제이슨 형식의 문서를 저장하고자 할 때 json.dumps를 사용한다.

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [119]:
res['siblings'] # 리스트 안에 딕셔너리가 2개가 존재하고 딕셔너리 안에 리스트가 존재한다.

[{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
 {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]

In [120]:
pd.DataFrame(res['siblings'])

    name  age            hobbies
0  Scott   34  [guitars, soccer]
1  Katie   42      [diving, art]

In [121]:
# 그나마 세련되게 정리되었다. 다만 취미부분에 리스트로 겹쳐져 있다.
# json형식의 파일 내용을 읽어 데이터프레임 형식으로 표현이 가능하다는 것을 알 수 있다.
pd.read_json("example.json")

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
# 키가 abc로 저장되어져 있고 012순으로 인덱스가 부여되었다.
# json파일 로드방법은 두개가 있다.
# json.loads("")이것은 문자열로 나타낸다.
# read_json("")은 데이터프레임으로 나타낸다.

In [133]:
import pandas as pd#일반적인 판다스 불러오기
from pandas import Series

In [125]:
#pd.Series() 일반적인 판다스 시리즈 제작. 만약 시리즈를 바로 만든다면? from을 사용한다.

In [126]:
ser([10,20,30])
# 사실 권장하지는 않는다. 남들이 보기에 생소한 함수를 생성하는 것이나 다름없기 때문이다.
# 시리즈를 ser이라고 별칭으로 만든건데 이것은 함수가 아니다. 
# 그래서 pd.Series()를 좀 더 권장한다.

0    10
1    20
2    30
dtype: int64

In [128]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = ser(data, index)
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [ ]:
# 시리즈를 만들 때 데이터(변수, 변수명) 순서대로 만들었다.

In [129]:
score = [100, 200, 300]
name = ["철수", "영희", "아름"]
s = ser(data = score, index = name)
print(s)
#결과는 동일할 것이다.

철수    100
영희    200
아름    300
dtype: int64

In [ ]:
# data는 속성명이고 =  옆에 있는 것은 속성 값이다. 
# 처음 것은 변수명으로 지정한 것이다. data, index는 변수명이다. 앞에 생략된 것은 data = data, index = index이다.
# 두번째 것은 속성명이다. 속성명은 디폴트값이 지정이 되어있다. 디폴트값이 지정되어 있는 경우 따로 적지 않아도 작동한다.
# 또는 속성이름을 생략해도 위치에 맞게 자동적으로 지정된다.

In [131]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = ser(data)
s.index = index
print(s)

철수    100
영희    200
아름    300
dtype: int64

In [ ]:
# 위와 같은 경우는 데이터만 들어가고 인덱스는 s.index로 따로 부여한 경우이다. 따로 부여하지 않으면 숫자 0,1,2순으로 부여된다. 
# s.index는 속성이다. index는 변수이다. 둘은 엄연히 다르다.

In [ ]:
# 딕셔너리로 부터 바로 시리즈를 만들어보자.

In [136]:
score = {
    "철수": 100,
    "영희": 200,
    "아름": 300
}

s = Series(score)
s

철수    100
영희    200
아름    300
dtype: int64

In [137]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [138]:
s.values

array([100, 200, 300], dtype=int64)

In [139]:
s.index

Index(['철수', '영희', '아름'], dtype='object')

In [140]:
s.to_dict()
# 무엇인가를 변화시킬 때는 to_ 를 쓰게 된다.

{'철수': 100, '영희': 200, '아름': 300}

In [141]:
s.to_excel("mydata.xlsx")
#헤더가 마음에 안든다면

In [142]:
s.to_excel("mydata.xlsx", header = False)
# 행 인덱스가 사라졌고 정리되었다.

In [145]:
pd.read_excel("mydata.xlsx",header = None)
#헤더를 다시 붙여보자.

    0    1
0  철수  100
1  영희  200
2  아름  300

In [147]:
# 시리즈에 대해서 동일하게 해보자.
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [148]:
s.dtype #s의 내부 데이터의 타입을 알아본다.

dtype('int64')

In [149]:
type(s) # s의 전체적인 타입을 알아본다.

pandas.core.series.Series

In [151]:
data = [  10,  "가" ]
s = Series( data )
s #숫자와 문자가 같이 있다. 이것은 오브젝트이다.

0    10
1     가
dtype: object

In [ ]:
# 1차원(벡터)가 여러개 합친 것을 2차원(행렬)이 된다.
# 하나의 열내부에서는 같은 타입인 경우가 일반적이다. 
# 즉 위에는 열 내부에 다른 타입이 되어서 10이 있어도 문자타입이 된 것이다.

In [153]:
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s

철수    100
영희    200
아름    300
dtype: int64

In [154]:
s.index.dtype #대문자 O 이다 오브젝트다.

dtype('O')

In [155]:
import pandas as pd

data = {"apple": 1500, "banana": 3000}
s = pd.Series(data)
s

apple     1500
banana    3000
dtype: int64

In [156]:
# 딕셔너리의 키가 인덱스, 딕셔너리의 값이 데이터로 가게 된다. 만약 이것을 딕셔너리로 다시 바꾼다면?
s.to_dict()

{'apple': 1500, 'banana': 3000}

In [158]:
s = pd.Series(['1', '2', '3'])
s #보기에는 숫자지만 타입이 오브젝트(문자)이다. 데이터를 숫자로 바꾸고자 한다면? 솔직히 int를 일일히 쓰기 싫잖아.

0    1
1    2
2    3
dtype: object

In [159]:
s.astype("int64") #괄호 안의 속성으로 데이터타입을 변경하라 float64와 같이 변환이 가능하다.
# 만약 진짜 문자라면 int나 float로 바꿀 수 없다. 숫자로 된 문자에 한해서 가능하다.

0    1
1    2
2    3
dtype: int64

In [169]:
# iloc, loc등은 계속 복습하자. 매우 중요하다.
data = [100, 200, 300]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s
#여기에 새로운 데이터를 추가한다고 해보자. 영수, 400추가한다.

철수    100
영희    200
아름    300
dtype: int64

In [162]:
s["영수"]=400

In [166]:
s

영희    200
아름    300
영수    400
dtype: int64

In [165]:
del s["철수"] #삭제도 간단하다. 이것 외에도 드랍함수도 가능하다.

In [167]:
s.drop("영수") # 원본이 유지된다.del함수와 다른 점은 원본이 변하냐 안변하냐의 차이이다.

영희    200
아름    300
dtype: int64

In [170]:
s

철수    100
영희    200
아름    300
dtype: int64

In [171]:
s = s.iloc[1:] # 이 방법도 존재한다. 삭제와 동일한 효과를 낸다.

영희    200
아름    300
dtype: int64

In [175]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [179]:
s.index.unique() #인덱스 유니크도 가능하다.

Index(['김과장', '이대리', '박전무'], dtype='object')

In [180]:
s.unique() # 일반 유니크

array([ 9000,  8000, 10000], dtype=int64)

In [181]:
s = pd.Series(
    data = [9000, 9000, 8000, 9000, 10000],
    index = ['김과장', '이대리', '박전무', '이대리', '이대리']
)
s

김과장     9000
이대리     9000
박전무     8000
이대리     9000
이대리    10000
dtype: int64

In [183]:
s.value_counts() # 밸류카운트를 배웠을 것이다.

9000     3
8000     1
10000    1
dtype: int64

In [184]:
s.index.value_counts() #인덱스 벨류카운트도 가능하다.

이대리    3
김과장    1
박전무    1
dtype: int64

In [186]:
data = {
    "삼성전자": "전기,전자",
    "LG전자": "전기,전자",
    "현대차": "운수장비",
    "NAVER": "서비스업",
    "카카오": "서비스업"
}
s = Series(data)
s

삼성전자     전기,전자
LG전자     전기,전자
현대차       운수장비
NAVER     서비스업
카카오       서비스업
dtype: object

In [187]:
s.value_counts()

전기,전자    2
서비스업     2
운수장비     1
dtype: int64

In [188]:
data = [100, 300, 200]
index = ["08/01", "08/02", "08/03"]
s = Series(data, index)
s

08/01    100
08/02    300
08/03    200
dtype: int64

In [191]:
s.iloc[[0,1,2]] #데이터 참조 순서 바꾸는 상황에서 사용하자.

08/01    100
08/02    300
08/03    200
dtype: int64

In [192]:
import numpy as np

data = np.random.randint(10, size=4)
s = Series(data)
s

0    0
1    7
2    2
3    4
dtype: int32

In [193]:
s.sort_values() # 시리즈 오름차순 정렬이다.

0    0
2    2
3    4
1    7
dtype: int32

In [194]:
s.sort_values(ascending=False) # 어센딩을 false로 줘서 내림차순 결과를 얻을 수 있다.

1    7
3    4
2    2
0    0
dtype: int32

In [195]:
s.sort_index() # 인덱스 오름차순 정렬이다.내림차순은 위를 참고

0    0
1    7
2    2
3    4
dtype: int32

In [197]:
# 시리즈는 데이터프레임보다는 사용빈도가 적은 편이지만 시리즈도 상당히 자주 사용된다.
data = [100, 300, 200]
s = Series(data)
s
#각각의 수치데이터에서 100을 더한 값을 구하고자 한다.

0    100
1    300
2    200
dtype: int64

In [198]:
s+100

0    200
1    400
2    300
dtype: int64

In [203]:
high = Series(data=[51500, 51200, 52500], index=["5/3", "5/2", "5/1"])
low = Series(data=[50700, 50500, 50500], index=["5/1", "5/2", "5/4"])
high

5/3    51500
5/2    51200
5/1    52500
dtype: int64

In [201]:
low

5/1    50700
5/2    50500
5/4    50500
dtype: int64

In [204]:
# 두 시리즈 간에 빼기를 한다면?
high-low
# 인덱스 기준으로 정렬이 되었으며 한쪽의 데이터가 없으면 nan이 출력되었다.
# 재밌는 것은 인덱스의 순서를 바꿔도 인덱스끼리 빼기가 이루어졌다. 
# 즉 시리즈끼리 연산하면 행인덱스가 같은 것 끼리 연산이 수행된다. 
# 사실 위의 날짜같은 요소는 문자열일 뿐이다. 인덱스로 사용되는 문자열이다.

5/1    1800.0
5/2     700.0
5/3       NaN
5/4       NaN
dtype: float64

In [205]:
s = Series(data=[51500, 51200, 52500], index=["5/1", "5/2", "5/3"])
s

5/1    51500
5/2    51200
5/3    52500
dtype: int64

In [206]:
s >=51700 #불린으로 결과가 나타난다.

5/1    False
5/2    False
5/3     True
dtype: bool

In [ ]:
s[s >=51700] #불린참조. True에 해당되는 값만 출력되었다.

In [208]:
s[(s >=51300) & (s<=53000)] # 앤드 연산자를 쓰기 위해서 대괄호를 씌우고 각 불린연산에 소괄호를 씌운다. 중간은 &나 |가 오면 된다.

5/1    51500
5/3    52500
dtype: int64

In [209]:
(s>=51300) & (s<=53000) # 참조하지 않으면 그저 True나 False로 출력된다.

5/1     True
5/2    False
5/3     True
dtype: bool

In [210]:
# 만약 미래에 다룰 데이터에서 총합을 구하는 것도 방법이다.
sum((s>=51300) & (s<=53000)) #True의 값이 출력되었다.

2

In [ ]:
len((s>=51300) & (s<=53000))#자료건수의 숫자이다.

In [ ]:
len(s[(s>=51300) & (s<=53000)]) # s로 묶어버린 케이스. 여기는 True에 해당되는 값만 나왔다.

In [211]:
from pandas import Series 

data = {
    "2020-12-11": 73400,
    "2020-12-10": 72900,
    "2020-12-09": 73900,
    "2020-12-08": 71700,
    "2020-12-07": 72900
}

s = Series(data)
s
# 키가 인덱스로 밸류가 데이터로 간 상태이다. 
# 수치데이터에 전체 연산결과를 얻고자 한다.

2020-12-11    73400
2020-12-10    72900
2020-12-09    73900
2020-12-08    71700
2020-12-07    72900
dtype: int64

In [212]:
s.sum()#더하는 것은 간단하다.

364800

In [213]:
s.mean()#평균 구하는 것도 간단하다.

72960.0

In [215]:
s.product()#값을 전부 곱한다. 그런데 이상하다. 마이너스가 나왔다. 
#int 64의 범위를 벗어났기 때문에 그렇다.

-6514723640420366336

In [218]:
s = s.astype('float64')
s

2020-12-11    73400.0
2020-12-10    72900.0
2020-12-09    73900.0
2020-12-08    71700.0
2020-12-07    72900.0
dtype: float64

In [219]:
s.product() # 200경 가량이 나왔다.

2.06687737175922e+24

In [221]:
data = [1, 2, 3, 4, np.nan]
s = Series(data=data)
s
# np.nan으로 결측값을 임의로 나타냈다.
#

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
dtype: float64

In [224]:
s.isna() # 결측값의 갯수이다.

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [226]:
sum(s.isna())
s.isna().sum()#둘다 똑같은 결과이다.

1

In [227]:
s.notna()#결측값이 아닌것의 갯수이다.

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [228]:
s.notna().sum() #결측값이 아닌 인덱스의 갯수이다.

4

In [262]:
data = ["100,000", "200,000", "300,000"]
index = ["철수", "영희", "아름"]
s = Series(data, index)
s
#시리즈에 금액이 들어가 있는데 콤마가 들어가 있다.

철수    100,000
영희    200,000
아름    300,000
dtype: object

In [259]:
s.astype('int') #콤마가 있어서 애러가 뜰 것이다. 콤마를 제거하는 것이 필요한 것이다.
# replace함수로 이 문제를 해결할 수 있다.

ValueError: invalid literal for int() with base 10: '100,000'

In [260]:
s = s.map(lambda x : x.replace(",","")).astype('int')
s # 오랜만에 쓰는 맵함수. 지금 다시 잊어먹었다. 
# 생각해보니 각각의 변수를 바꿔야지 하나만 바꾸면 안되잖아.
# 쉽지않네 머리가 비어버렸어.

철수    100000
영희    200000
아름    300000
dtype: int32

In [264]:
# 이 외에도 사용 가능한 연산자가 하나 더 있다.
# 일괄적으로 특정 연산을 하고 싶다면 str을 사용한다.
s.str.replace(",","") #모든 데이터에 대해 일괄적으로 수행한다.
# 시리즈의 데이터가 문자열로 이루어져 있을때 시리즈.str.문자열함수()로 가능하다.
#

철수    100000
영희    200000
아름    300000
dtype: object

In [298]:
s = pd.Series([1, 2, 3], index=['2023-01-01', '2023-01-02', '2023-01-03'])
s

2023-01-01    1
2023-01-02    2
2023-01-03    3
dtype: int64

In [299]:
s.index = s.index.str[5:]
s

01-01    1
01-02    2
01-03    3
dtype: int64

In [285]:
# 금일의 문제.
# 타이타닉 데이터를 보면 이름열이 존재한다. 여기에서 호칭(mr,miss,mrs)을 추출한다.

Index(['01-01', '01-02', '01-03'], dtype='object')

In [3]:
df= pd.read_csv("titanic/train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [325]:
ans2 = pd.Series(df.Name)
print("Mr.의 숫자 :",sum(ans2.map(lambda x : "Mr."in x)))
print("Miss.의 숫자 :",sum(ans2.map(lambda x : "Miss."in x)))
print("Mrs.의 숫자 :",sum(ans2.map(lambda x : "Mrs."in x)))

Mr.의 숫자 : 517
Miss.의 숫자 : 182
Mrs.의 숫자 : 125

In [436]:
import re
ans2 = list(df.Name)
ans3 = []
ans10 = set()
for i in range(len(ans2)):
    ans3 = re.match("[A-Za-z, ]+",ans2[i])
    ans4 = ans3.span()[1]
    ans5 = ans2[i][:ans4]
    if "," in ans5:
        ans10.add(ans5.split(',')[-1])
print(ans10)

{' Sir', ' Dr', ' Capt', ' Rev', ' Jonkheer', ' Miss', ' Mr', ' Mrs', ' Lady', ' Ms', ' Don', ' Mme', ' the Countess', ' Mlle', ' Major', ' Master', ' Col'}

In [6]:
df['Name'].str.split(' ', expand=True)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,"Braund,",Mr.,Owen,Harris,None,None,None,None,None,None,None,None,None,None
1,"Cumings,",Mrs.,John,Bradley,(Florence,Briggs,Thayer),None,None,None,None,None,None,None
2,"Heikkinen,",Miss.,Laina,None,None,None,None,None,None,None,None,None,None,None
3,"Futrelle,",Mrs.,Jacques,Heath,(Lily,May,Peel),None,None,None,None,None,None,None
4,"Allen,",Mr.,William,Henry,None,None,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,"Montvila,",Rev.,Juozas,None,None,None,None,None,None,None,None,None,None,None
887,"Graham,",Miss.,Margaret,Edith,None,None,None,None,None,None,None,None,None,None
888,"Johnston,",Miss.,Catherine,Helen,"""Carrie""",None,None,None,None,None,None,None,None,None
889,"Behr,",Mr.,Karl,Howell,None,None,None,None,None,None,None,None,None,None
890,"Dooley,",Mr.,Patrick,None,None,None,None,None,None,None,None,None,None,None

In [5]:
df['Name'].str.split(' ')

0                           [Braund,, Mr., Owen, Harris]
1      [Cumings,, Mrs., John, Bradley, (Florence, Bri...
2                             [Heikkinen,, Miss., Laina]
3      [Futrelle,, Mrs., Jacques, Heath, (Lily, May, ...
4                          [Allen,, Mr., William, Henry]
                             ...
886                            [Montvila,, Rev., Juozas]
887                    [Graham,, Miss., Margaret, Edith]
888       [Johnston,, Miss., Catherine, Helen, "Carrie"]
889                           [Behr,, Mr., Karl, Howell]
890                              [Dooley,, Mr., Patrick]
Name: Name, Length: 891, dtype: object